Revit 2024 API
CategorySet.Insert Method
Insert the specified category into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	Category item
)
Visual Basic
Public Overridable Function Insert ( _
	item As Category _
) As Boolean
Visual C++
public:
virtual bool Insert(
	Category^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Category
The item to be inserted into the set.
Return Value
Returns whether the item was inserted into the set.
See Also
CategorySet Class
Autodesk.Revit.DB Namespace